{"problems":[{"title":"PermutariAB","statement":"Se consideră 2 permutări A şi B ale mulţimii {1, 2, ..., N}. Printr-o operaţie se pot selecta două elemente adiacente din B şi să se interschimbe (i.e. swap(B[i], B[i + 1]) pentru 1 ≤ i < N). Să se determine numărul minim de operaţii care trebuiesc efectuate pentru a transforma pe B în A.","input":"Fişierul de intrare permutariab.in conţine pe prima linie numărul natural N. Pe a doua linie se află N numere naturale, separate prin câte un spaţiu, reprezentând permutarea A. Pe a treia linie se află de asemenea N numere naturale, separate prin câte un spaţiu, reprezentând permutarea B.","output":"Fişierul de ieşire permutariab.out conţine pe prima linie numărul natural X, reprezentând numărul minim de operaţii care trebuiesc efectuate pentru a transforma pe B în A.","id":"boh98ex4g"},{"title":"Suma","statement":"Se dau 2 numere naturale. Calculaţi suma celor 2 numere date.","input":"Programul citește de la tastatură 2 numere naturale.","output":"Programul va afișa pe ecran suma celor două numere.","id":"vam2s06r1"},{"title":"Suma Cifrelor","statement":"Se da un numar natural. Calculaţi suma cifrelor numărului dat.","input":"Programul va citi de la tastatură un număr natural.","output":"Programul va afişa pe ecran suma cifrelor numărului citit.","id":"u6pjuddg24"},{"title":"cntcifsum","statement":"Se dă un număr N și un număr S. Să se determine câte numere de N cifre au suma cifrelor S.","input":"Programul citește de la tastatură numerele N și S.","output":"Programul va afișa pe ecran numărul C, reprezentând numărul de numere de N cifre având suma cifrelor S modulo 666013.","id":"v90dfasvk0r"},{"title":"cntSQ","statement":"Se dă o matrice binară (valori 0 și 1). Să se determine câte pătrate există cu proprietatea proprietatea că acestea au pe marginea lor doar valori 1.","input":"Fișierul de intrare cntsq.in conține pe prima linie numerele N și M, reprezentând numărul de linii și numărul de coloane ale matricei, apoi N linii, pe fiecare câte M valori 0 sau 1, neseparate prin niciun spațiu, reprezentând elementele matricei.","output":"Fișierul de ieșire cntsq.out va conține pe prima linie numărul C, reprezentând numărul de pătrate ce conțin doar 1 pe marginea lor.","id":"uj59qilpls"},{"title":"Mygo","statement":"Mygo este un bun informatician, însă nu se prea descurcă la probleme de matematică. Șcuțu, bunul său prieten, s-a decis să-l ajute, și îi propune următoarea problemă: “Dându-se un vector A cu 10 componente numere naturale, se întreabă câte numere distincte cu ∑i=09A[i] cifre există astfel încât să conțină exact A[0] cifre de 0, A[1] cifre de 1, … A[9] cifre de 9?”. Mygo a promis că va rezolva această problemă, însă va da rezultatul modulo 666013.","input":"Fișierul de intrare mygo.in conține pe prima linie 10 numere naturale, reprezentând elementele vectorului A.","output":"Fișierul de ieșire mygo.out va conține pe prima linie numărul S, reprezentând răspunsul dat de Mygo.","id":"ptd4xju2p8"},{"title":"P2017","statement":"Să se răspundă la Q întrebări de forma: “Care este numărul natural minim x astfel încât cifra c să apară de cel puțin K ori în reprezenatrea tuturor numerelor naturale nenule mai mici sau egale cu x?”","input":"Fișierul de intrare 2017.in conține pe prima linie numărul Q, iar pe următoarele Q linii se află câte două numere naturale c și K separate printr-un spațiu, reprezentând întrebările.","output":"Fișierul de ieșire 2017.out va conține Q linii, pe linia i aflându-se răspunsul la întrebarea i.","id":"5nq4rd8eri"},{"title":"MCub","statement":"Alexandru este foarte pasionat de cuburi. Într-o zi, acesta a creat un zid format din N turnuri de cuburi, turnul i fiind alcătuit din H[i] cuburi puse unul peste altul. Având acest zid, el își pune următoarea întrebare: Dacă aș porni de la un zid “gol” cu N turnuri (gol înseamnă ca H[i] = 0 pentru orice 1 ≤ i ≤ N) iar singura operație pe care o pot face este să aleg doi indici i și j cu 1 ≤ i ≤ j ≤ N și să pun câte un cub peste fiecare turn în intervalul i și j, care este numărul minim de astfel de operații ce trebuie efectuate pentru a obține zidul inițial? Lui Alexandru i s-a părut banală problema așa că te provoacă și pe tine să o rezolvi.Lui Alexandru i s-a părut banală problema așa că te provoacă și pe tine să o rezolvi.","input":"Fișierul de intrare mcub.in conține pe prima linie numărul N, iar pe a doua linie N numere naturale ce reprezintă înălțimile fiecărui turn al zidului.","output":"Fișierul de ieșire mcub.out va conține pe prima linie numărul S, reprezentând răspunsul întrebării puse de Alex.","id":"yht499ga1"},{"title":"Himalaya","statement":"Jany MooRANDy este șeful valutei peste țara sa MORANDIA. Pentru a-și tachina dușmanii, el a declarat următoarele: “Să bată vântul și ploaia, eu fac bani și-n Himalaya! Unde fac eu bani pachete, dușmanii culeg doar pietre!”. Pentru a le dovedi acestea, el a mers în munții Himalaya. Aceștia sunt alcătuiți din N vârfuri, vârful i având înălțimea H[i]. El va construi o telecabină ce va porni din vârful 1 și va ajunge în vârful N. Cabina va avea K puncte de oprire (un punct de oprire este considerat un vârf) unde dușmanii săi vor culege pietre. Fie două puncte de oprire consecutive i și j (i < j). Dacă H[i] ≤ H[j] atunci dușmanii vor plăti (H[j] - H[i]) * C1, altfel (H[i] - H[j]) * C2, pentru a ajunge de la punctul de oprire i la punctul de oprire j. Ajutațil pe Jany MooRANDy să facă bani pachete, aflând amplasarea cea mai mică lexicografică a celor K puncte de oprire, astfel încât dușmanii să plătească o sumă maximă de bani.","input":"Fișierul de intrare himalaya.in conține pe prima linie numerele N, K, C1, C2 , iar pe a doua linie N numere naturale separate prin spații.","output":"Fișierul de ieșire himalaya.out va conține pe prima linie K numere, separate prin câte un spațiu reprezentând vârfurile unde se vor pune punctele de oprire.","id":"s92ni7mq8"}]}